### Common Table Expression
A Common Table Expression (CTE) is a temporary result set derived from a simple query specified in a WITH clause, which immediately precedes a SELECT or INSERT keyword.  The CTE is defined only within the execution scope of a single statement.  One or more CTEs can be used in a Hive SELECT, INSERT,Â CREATE TABLE AS SELECT, or CREATE VIEW AS SELECT statement.

#### CTE in Select Statements

with q1 as ( select key from src where key = '5')
select *
from q1;

####  from style

with q1 as (select * from src where key= '5')
from q1
select *;

#### chaining CTEs

with q1 as ( select key from q2 where key = '5'),
q2 as ( select key from src where key = '5')
select * from (select key from q1) a;

#### union example

with q1 as (select * from src where key= '5'),
q2 as (select * from src s2 where key = '4')
select * from q1 union all select * from q2;

#### CTE in Views, CTAS, and Insert Statements

# -- insert example

create table s1 like src;
with q1 as ( select key, value from src where key = '5')
from q1
insert overwrite table s1
select *;

#-- ctas example

create table s2 as
with q1 as ( select key from src where key = '4')
select * from q1;

#-- view example

create view v1 as
with q1 as ( select key from src where key = '5')
select * from q1;
select * from v1;

#-- view example, name collision

create view v1 as
with q1 as ( select key from src where key = '5')
select * from q1;
with q1 as ( select key from src where key = '4')
select * from v1;

#### Example

with cte_em as (select * from emp1 where gender == 'Male')
select * from cte_em limit 5;

with cte_em1 as (select * from emp1)
select * from cte_em1 where age > 50

with cte_em1 as (select * from emp1)
from cte_em1 
select * where age < 20

with cte_em2 as (select department, gender, max(age) max_age, min(age) min_age 
             from emp1 group by department, gender)
from cte_em2
select * where max_age >50;

with cte1 as (select department, gender, max(age) over(partition by department) max_age, row_number() over(partition by department order by monthlyincome) ro1 from emp1),
cte2 as (select department, gender, min(age) over(partition by department) min_age, row_number() over(partition by department order by monthlyincome) ro2 from emp1)

from cte1, cte2
select * where cte1.ro1 == cte2.ro2 limit 5

create table test_em like emp1;

with cte1 as(select * from emp1 where gender == 'Male')
from cte1
insert into table test_em 
select * where age > 50;

create table test_em1 like emp1;

with cte1 as(select * from emp1 where gender == 'Male')
from cte1
insert overwrite table test_em1 
select * where age > 50;

create table s2 as 
with cte1 as (select * from emp1 where gender == 'Male')
select * from cte1 where age > 50;

create view s22 as 
with cte1 as (select * from emp1 where gender == 'Male')
select * from cte1 where age > 50;

select department, gender, age, (case when gender == 'Male' then 1 else 0 end )gender_num from emp1 limit 5

select department, gender, age, (case when gender == 'Male' then 1 else 0 end) gender_num,
        (case when age > 50 then 'old' when age > 25 then 'young' 
         when age < 25 then 'jr' else 'diff' end) age_gp 
    from emp1 limit 5

with cte1 as (
select department, gender, age, (case when gender == 'Male' then 1 else 0 end) gender_num,
        (case when age > 50 then 'old' when age > 25 then 'young' 
         when age < 25 then 'jr' else 'diff' end) age_gp 
    from emp1 limit 5)

from cte1
select * where age_gp == 'jr'